import numpy as np


# 九个九点标定板的相机坐标（x，y）
camera_points = np.array([
[269, 196],
[325, 195],
[378, 193],
[270, 271],
[324, 269],
[378, 268],
[271, 342],
[325, 341],
[379, 340],
])

# 九个九点标定板的机械臂坐标（X，Y）
robot_points = np.array([
[88.442185, 500.752489],
[86.974916, 536.229892],
[87.785958, 570.538101],
[53.550325, 503.693904],
[56.798358, 539.519119],
[54.005994, 575.617235],
[21.885813, 506.467163],
[17.393224, 543.373099],
[16.797362, 580.838991]
])

# 构造增广矩阵
A = np.column_stack((camera_points, np.ones((9, 1))))

# 使用最小二乘法求解仿射变换矩阵
affine_matrix, residuals, _, _ = np.linalg.lstsq(A, robot_points, rcond=None)

# 打印仿射变换矩阵
print("仿射变换矩阵：")
print(affine_matrix)
