import numpy as np


# 九个九点标定板的相机坐标（x，y）
camera_points = np.array([
[333, 164],
[388, 162],
[440, 162],
[332, 237],
[387, 237],
[440, 236],
[332, 306],
[385, 307],
[437, 310],
])

# 九个九点标定板的机械臂坐标（X，Y）
robot_points = np.array([
[16.022347, 531.487644],
[11.641015, 501.286424],
[9.985313, 469.257627],
[46.733203, 533.469447],
[45.313708, 497.791369],
[45.639049, 462.709265],
[77.621592, 532.119664],
[73.713788, 500.884381],
[70.913252, 466.287113]
])

# 构造增广矩阵
A = np.column_stack((camera_points, np.ones((9, 1))))

# 使用最小二乘法求解仿射变换矩阵
affine_matrix, residuals, _, _ = np.linalg.lstsq(A, robot_points, rcond=None)

# 打印仿射变换矩阵
print("仿射变换矩阵：")
print(affine_matrix)
